/*
*********************************************************************************************************
*
*
*                               2.4GHz Radio Frequency Communication
*                                       2.4GHz无线射频通信
* File : 2.4GRF.c
* By   : 
* Date : 2019/1/7
* version : V0.1 
* NOTE(s) : 
* History : 
*
*
*********************************************************************************************************
*/


/*
*********************************************************************************************************
*                                       INCLUDES            头文件
*********************************************************************************************************
*/
#include "bsp_sys.h"
#include "bsp_uart.h"
#include "2_4GRF.h"


/*
*********************************************************************************************************
*                                       STATEMENT           声明
*********************************************************************************************************
*/


/*
*********************************************************************************************************
*                                       CONSTANTS           常量
*********************************************************************************************************
*/
#define MAX_TX_UNITS_SIZE 10    ///< 发送队列单元最大单元数量


/*
*********************************************************************************************************
*                                       VARIABLES           变量
*********************************************************************************************************
*/
_NRF_TX_QUEUE_UNIT _2_4GRF_TXUnitArray[MAX_TX_UNITS_SIZE];     ///< 发送队列单元数组

Queue _2_4GRF_RXQueue;              ///< 接收缓冲队列
uint8_t _2_4GRF_RXUnitArray[256];  ///< 接收队列单元数组


/*
*********************************************************************************************************
*                                       LOCAL FUNCTIONS     静态函数
*********************************************************************************************************
*/
/**
  * @brief  Receive data callback function
  * @param  pRx_buf： Point to the first address of the data receive buffer
  * @param  rx_len：  The length of valid data in the data receive buffer
  * @note
  * @retval None
  */
void rx_handle_cbfunc( uint8_t *pRx_buf,uint8_t rx_len )
{
    for( int i=0;i<rx_len;i++ )
    {
        Queue_In( &_2_4GRF_RXQueue,&pRx_buf[i],sizeof(uint8_t),ISFULL_DEL_OLD,NULL );
    }
//    printf("%d  %s",rx_len,pRx_buf);
}


/*
*********************************************************************************************************
*                                       API FUNCTIONS       API接口函数
*********************************************************************************************************
*/
/*
*********************************************************************************************************
*                                        _2_4GRF_Init()
*
* Description : 2.4GHz 无线射频模块初始化函数
*
* Arguments   : 
*
* Return      : 
*
*Note(s):
*********************************************************************************************************
*/
uint8_t _2_4GRF_RXADDR[5] = { 0x34,0x43,0x10,0x10,0x01 };
void _2_4GRF_Init(void)
{
    Queue_Create( &_2_4GRF_RXQueue,_2_4GRF_RXUnitArray,256,sizeof(uint8_t) );
    
    memset( _2_4GRF_TXUnitArray,0,sizeof(_2_4GRF_TXUnitArray) );
    
    NRF24L01_Config( _2_4GRF_TXUnitArray,MAX_TX_UNITS_SIZE,rx_handle_cbfunc );
    
    NRF24L01_SET_RxAddr( _2_4GRF_RXADDR,5 );
    NRF24L01_RX(ACK);
}

void _2_4GRF_DealRxData(void)
{
    uint8_t a;
    
    if( QUEUE_ERR_EMPTY != Queue_Out(&_2_4GRF_RXQueue,&a,sizeof(uint8_t)) )
    {
        printf( "%c",a );
    }
}

