/*
*********************************************************************************************************
*
*
*                                      Board Support Package
*                                        板级支持包
* File : bsp.c
* By   : 
* Date : 
* version : 
* NOTE(s) : bsp是介于主板硬件和操作系统中驱动层程序之间的一层
* History : 
*
*
*********************************************************************************************************
*/


/*
*********************************************************************************************************
*                                       INCLUDES            头文件
*********************************************************************************************************
*/
#include "user_main.h"
#include "tpad.h"
#include "CommNetUart.h"


/*
*********************************************************************************************************
*                                       CONSTANTS           常量
*********************************************************************************************************
*/


/*
*********************************************************************************************************
*                                       VARIABLES           变量
*********************************************************************************************************
*/


/*
*********************************************************************************************************
*                                       LOCAL FUNCTIONS     静态函数
*********************************************************************************************************
*/
/**@brief   基本硬件平台初始化函数
	*@param   None
	*@ret     None
	*/
static void platform_init(void)
{
    delay_init();                       //系统时钟  延时函数初始化
    
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
    
    /* 板载LED指示灯相关硬件初始化 */
    LED_Init();
    
    HT1621_Init();
    
    /* 调试串口的初始化 */
    DebugInit();
}


/*
*********************************************************************************************************
*                                       API FUNCTIONS       API接口函数
*********************************************************************************************************
*/
/*
*********************************************************************************************************
*                                        System_Reset()
*
* Description : Reset the system by software.    系统软件复位
*
* Arguments   : void
*
* Return      : void
*
*Note(s):
*********************************************************************************************************
*/
void System_Reset(void)
{	
    __disable_irq();
    __enable_irq();
    __set_FAULTMASK(1);//关闭所有中断
//    SCB->AIRCR=0x05FA0000 | (u32)0x04;
    NVIC_SystemReset();
}
/*
*********************************************************************************************************
*                                        reboot()
*
* Description : Jump to the main function to run again.    跳转到main函数重新运行
*
* Arguments   : void
*
* Return      : void
*
*Note(s):
*********************************************************************************************************
*/
void reboot(void)
{
    pFunction Jump_To_Application;                  //定义指向函数的指针
    uint32_t JumpAddress;

    JumpAddress         = *(vu32*) (0x00000004);    //程序最开始的入口处，也就是main函数
    Jump_To_Application = (pFunction) JumpAddress;  //指向复位处,返回值为空
    Jump_To_Application();
}


/*
*********************************************************************************************************
*                                        BSP_Init()
*
* Description : To initialize the hardwares.    初始化硬件
*
* Arguments   : void
*
* Return      : void
*
*Note(s):
*********************************************************************************************************
*/
E2PFS myFs;
uint8_t myDrv = 0;
void BSP_Init(void)
{
    uint8_t res;
    
    /* 基本硬件平台初始化 */
    platform_init();

    /* 触摸按键的初始化 */
    tpad_init();
    
    /* 网络串口的初始化 */
//    CommNetUart_Init();
    
    /* 2.4G无线模块的初始化 */
//    _2_4GRF_Init();
    
    /* eeprom 文件系统 */
//    if ( 0==e2pf_mkfs( &myFs,myDrv ) ) {
//        res = e2pf_mount( &myFs,myDrv );
//        if ( res==E2PFR_OK ) {
//            LED_1 = 0;
//        }
//    }
    res = e2pf_mount( &myFs,myDrv );
    if ( res==E2PFR_OK ) {
        LED_1 = 0;
    }
}

