/*
*********************************************************************************************************
*
*
*                                   Flash emulation EEPROM driver package
*                                         flash模拟EEPROM驱动程序包
* File : bsp_flash.h
* By   : 
* Date : 
* version : 
* NOTE(s) : 
* History : 
*
*
*********************************************************************************************************
*/
#ifndef __BSP_FLASH_H
#define __BSP_FLASH_H


/*
*********************************************************************************************************
*                                       INCLUDES            头文件
*********************************************************************************************************
*/
#include "bsp_sys.h"


/*
*********************************************************************************************************
*                                       CONSTANTS           常量
*********************************************************************************************************
*/
/* 用户根据自己的需要设置 */
#define STM32_FLASH_SIZE 512    //所选STM32的FLASH容量大小(单位为K)
#define STM32_FLASH_WREN 1      //使能FLASH写入(0，不是能;1，使能)

//FLASH起始地址
#define STM32_FLASH_BASE 0x08000000 	//STM32 FLASH的起始地址
//FLASH解锁键值
#define FLASH_SAVE_ADDR     0X08070000

#define FLAG_VALID_BLOCK    0xA5    //有效存储块的标志
#define FLAG_INVALID_BLOCK  0x00    //失效标志
#define MAX_SIZE_PER_BLOCK  32      //每一个存储块的最大size


/*
*********************************************************************************************************
*                                       DATA TYPE           数据类型
*********************************************************************************************************
*/
typedef struct _Flash_CtrlTypeDef
{
    u16 cnts_block;     //每一页分块的总数
    u16 curNum_block;   //当前正在使用的块编号
    
    u8  have_valid;     //有无有效值
}Flash_CtrlTypeDef;


/*
*********************************************************************************************************
*                                       VARIABLE STATEMENT  变量声明
*********************************************************************************************************
*/


/*
*********************************************************************************************************
*                                       FUNCTION STATEMENT  函数声明
*********************************************************************************************************
*/
void STMFLASH_Init  (void);
void STMFLASH_Write (u16 *pBuffer,u16 NumToWrite);  //从指定地址开始写入指定长度的数据
u8   STMFLASH_Read  (u16 *pBuffer,u16 NumToRead);   //从指定地址开始读出指定长度的数据

#endif


